----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 32, 32, 32]             896
       BatchNorm2d-2           [-1, 32, 16, 16]              64
            Conv2d-3           [-1, 32, 16, 16]           9,248
       BatchNorm2d-4             [-1, 32, 8, 8]              64
            Conv2d-5             [-1, 64, 8, 8]          18,496
            Conv2d-6             [-1, 64, 8, 8]          36,928
            Conv2d-7            [-1, 128, 8, 8]          73,856
       BatchNorm2d-8            [-1, 128, 4, 4]             256
            Linear-9                 [-1, 1024]       2,098,176
           Linear-10                  [-1, 512]         524,800
           Linear-11                    [-1, 1]             513
           Conv2d-12           [-1, 32, 32, 32]             896
      BatchNorm2d-13           [-1, 32, 16, 16]              64
           Conv2d-14           [-1, 32, 16, 16]           9,248
      BatchNorm2d-15             [-1, 32, 8, 8]              64
           Conv2d-16             [-1, 64, 8, 8]          18,496
           Conv2d-17             [-1, 64, 8, 8]          36,928
           Conv2d-18            [-1, 128, 8, 8]          73,856
      BatchNorm2d-19            [-1, 128, 4, 4]             256
           Linear-20                 [-1, 1024]       2,098,176
           Linear-21                  [-1, 512]         524,800
           Linear-22                    [-1, 1]             513
           Conv2d-23           [-1, 32, 32, 32]           1,760
      BatchNorm2d-24           [-1, 32, 16, 16]              64
           Conv2d-25           [-1, 32, 16, 16]           9,248
      BatchNorm2d-26             [-1, 32, 8, 8]              64
           Conv2d-27             [-1, 64, 8, 8]          18,496
           Conv2d-28             [-1, 64, 8, 8]          36,928
           Conv2d-29            [-1, 128, 8, 8]          73,856
      BatchNorm2d-30            [-1, 128, 4, 4]             256
           Linear-31                 [-1, 1024]       2,098,176
           Linear-32                  [-1, 512]         524,800
           Linear-33                    [-1, 1]             513
           Linear-34                 [-1, 1024]       1,573,888
           Linear-35                  [-1, 512]         524,800
           Linear-36                    [-1, 1]             513
================================================================
Total params: 10,389,956
Trainable params: 10,389,956
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 36.00
Forward/backward pass size (MB): 1.64
Params size (MB): 39.63
Estimated Total Size (MB): 77.28